throughput_compare_20260525_124016/mgsd_v5_bench.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7ff5ae989c60>, trust_remote_code=True, seed=123, num_prompts=8, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label='mgsd_v5', backend='openai', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=4, model='Qwen3-32B', input_len=1024, output_len=4096, tokenizer='/data/models/Qwen3-32B', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=True, num_warmups=1, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/home/scd/MG-SD/throughput_compare_20260525_124016', result_filename='mgsd_v5.json', ignore_eos=True, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-7cbb2e05-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name='Qwen3-32B', lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 05-25 12:54:19 [utils.py:90] Sampling input_len from [1024, 1024] and output_len from [4096, 4096]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 1 requests...
Warmup run completed.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 4
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     8         
Failed requests:                         0         
Maximum request concurrency:             4         
Benchmark duration (s):                  302.36    
Total input tokens:                      8192      
Total generated tokens:                  32768     
Request throughput (req/s):              0.03      
Output token throughput (tok/s):         108.37    
Peak output token throughput (tok/s):    40.00     
Peak concurrent requests:                5.00      
Total token throughput (tok/s):          135.47    
---------------Time to First Token----------------
Mean TTFT (ms):                          695.96    
Median TTFT (ms):                        514.77    
P99 TTFT (ms):                           1287.40   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          27.22     
Median TPOT (ms):                        26.71     
P99 TPOT (ms):                           45.70     
---------------Inter-token Latency----------------
Mean ITL (ms):                           106.24    
Median ITL (ms):                         104.81    
P99 ITL (ms):                            127.33    
---------------Speculative Decoding---------------
Acceptance rate (%):                     58.10     
Acceptance length:                       3.90      
Drafts:                                  8394      
Draft tokens:                            41970     
Accepted tokens:                         24383     
Per-position acceptance (%):
  Position 0:                            87.63     
  Position 1:                            60.33     
  Position 2:                            52.73     
  Position 3:                            47.16     
  Position 4:                            42.63     
==================================================